Функция НовыйФЛ(стк) Экспорт
	
	сс = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(Стк.ГУИД));
	Если Найти(СокрлП(сс),"Объект не найден")<>0 Тогда
		Обк = Справочники.ФизическиеЛица.СоздатьЭлемент();
		Обк.УстановитьСсылкуНового(сс);
	ИНАче
		Обк = сс.ПолучитьОбъект();
	КонецеСЛИ;
	
	ЗаполнитьЗначенияСвойств(Обк,Стк);
	Обк.Записать();
	Сообщить("Записан "+обк);
	
	Возврат Обк.ссылка;
	
КонецФункции

Функция ФИОстр(стр,знВозврат="") Экспорт
	
	Если знВозврат="" Тогда знВозврат = Стр; КонецЕСлИ;
	
	Если стр="" Тогда Возврат знВозврат; КонецЕСЛИ;
	пСТр = СтрЗаменить(стр," ",Символы.ПС);
	Если СтрЧислоСтрок(пСтр)<3 Тогда Возврат знВозврат; КонецЕСЛИ;
	
	пФам = СтрПолучитьСтроку(пСтр,1);
	пИмя = СтрПолучитьСтроку(пСтр,2);
	пОтч = СтрПолучитьСтроку(пСтр,3);
	
	Возврат пФам+" "+Лев(пИмя,1)+"."+Лев(пОтч,1)+".";
	
КонецФункции