
Функция ПроверкаМодифицированности(Форма,Команда) Экспорт
	
	Если Форма.Модифицированность = Ложь Тогда Возврат Истина; КонецЕсли;
	
	Параметры = Новый Структура("Форма,Команда",Форма,Команда);
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект,Параметры);
	ПоказатьВопрос(Оповещение, "Данные изменены. Записать документ?", Режим, 0);
	Возврат ложь;
	
	//...
КонецФункции


Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат <> КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли;

   Параметры.форма.Записать();
   Параметры.форма.Печать(Параметры.команда);


КонецПроцедуры	
