&НаКлиенте
Перем СсылкаДефектГоден;

&НаСервереБезКонтекста
Функция ПолучитьСсылкаДефектГоден()
	Возврат Справочники.Дефекты.Годен;
КонецФункции

&НаКлиенте
Процедура ДефектовкаГоденПриИзменении(Элемент)
	
	Если СсылкаДефектГоден=Неопределено Тогда
		СсылкаДефектГоден = ПолучитьСсылкаДефектГоден();
	КонецЕсли;
	
	Стр = Элементы.Дефектовка.текущиеДанные;
	Стр.Годен = Истина;
	Стр.Реставрация = ложь;
	Стр.Изготовление = ложь;
	Стр.Покупка = ложь;
	Стр.Дефект = СсылкаДефектГоден;
	
КонецПроцедуры

&НаКлиенте
Процедура ДефектовкаНеГоденПриИзменении(Элемент)
	Если СсылкаДефектГоден=Неопределено Тогда
		СсылкаДефектГоден = ПолучитьСсылкаДефектГоден();
	КонецЕсли;
	
	имя = СтрЗаменить(Элемент.Имя,"Дефектовка","");
	
	Стр = Элементы.Дефектовка.текущиеДанные;
	Стр.Годен = ложь;
	Стр.Реставрация = ложь;
	Стр.Изготовление = ложь;
	Стр.Покупка = ложь;
	Стр[Имя] = Истина;
	
	Если Стр.Дефект = СсылкаДефектГоден Тогда
		Стр.Дефект = Неопределено;
	КонецЕСЛИ;
	
КонецПроцедуры

&НаКлиенте
Процедура ДефектовкаДефектыПриИзменении(Элемент)
	Если СсылкаДефектГоден=Неопределено Тогда
		СсылкаДефектГоден = ПолучитьСсылкаДефектГоден();
	КонецЕсли;
	
	Стр = Элементы.Дефектовка.текущиеДанные;
	Если Стр.Дефект = СсылкаДефектГоден Тогда
		ДефектовкаГоденПриИзменении(Элемент);
	ИНачеЕсли Стр.Годен = Истина Тогда
		ДефектовкаНеГоденПриИзменении(Новый Структура("Имя","Изготовление"));
	КонецЕСЛИ;
КонецПроцедуры

#Область КопироватьДефектовку

&НаКлиенте
Процедура СкопироватьДефектовку(Команда)
	
	оо = Новый ОписаниеОповещения("ОтветНаЗаполнениеДефектовки",ЭтотОбъект);
	Если Объект.Дефектовка.Количество()<>0 Тогда
		ПоказатьВопрос(оо,"Таблица дефектовки будет очищена. Продолжить?",РежимДиалогаВопрос.ДаНет);
	ИНаче
		ОтветНаЗаполнениеДефектовки(КодВозвратаДиалога.Да,Неопределено);
	КонецЕСЛИ;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаЗаполнениеДефектовки(Рез,Пар) Экспорт
	
	Если Рез<>КодВозвратаДиалога.Да Тогда Возврат; КонецЕсли;

	оо = Новый ОписаниеОповещения("ПослеВыбораОбрДляДефектовки",ЭтотОбъект);
	ОткрытьФорму("Справочник.ро_Оборудование.ФормаВыбораГруппы",,ЭтаФорма,ЭтаФорма,,,оо);

КонецПроцедуры	
	
&НаКлиенте
Процедура ПослеВыбораОбрДляДефектовки(Рез,Пар) Экспорт
	
	Если ЗначениеЗаполнено(Рез)=Ложь ТОгда Возврат; КонецЕСли;
	
	Мас = ПолучитьМасДефпоСС(Рез);
	
	Если Мас.Количество()=0 Тогда
		ПоказатьПредупреждение(,"В выбранной группе нет таблицы дефектовки.");
		Возврат;
	КонецЕсли;
	
	Объект.Дефектовка.Очистить();
	
	Для каждого Эл из Мас Цикл
		новстр = Объект.Дефектовка.Добавить();
		ЗаполнитьЗначенияСвойств(новСтр,Эл);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМасДефпоСС(сс)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	*
	               |ИЗ
	               |	Справочник.ро_Оборудование.Дефектовка КАК ро_ОборудованиеДефектовка
	               |ГДЕ
	               |	ро_ОборудованиеДефектовка.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",сс);
	ТБл = Запрос.Выполнить().Выгрузить();
	
	Возврат глСервер.ТблВМасСтк(Тбл);
	
КонецФункции

#КонецОбласти