
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.ЕдиницаИзмерения) = Ложь Тогда
		Объект.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ПолучитьЕдиницуИзмеренияПоУмолчанию();
	КонецЕСЛИ;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		 РучКорДавления = Ложь;
	КонецеСЛИ;
	
КонецПроцедуры

&НаКлиенте
Функция УстановитьФлагФормироватьНаименованиеПолноеАвтоматически(НаименованиеПолное,Наименование)
   
   Возврат (ПустаяСтрока(НаименованиеПолное) ИЛИ НаименованиеПолное = Наименование);
   
КонецФункции // УстановитьФлагФормироватьНаименованиеПолноеАвтоматически()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЭтаФорма.ТолькоПросмотр = Истина;
КонецПроцедуры


&НаКлиенте
Процедура Разблокировать(Команда)
	ЭтаФорма.ТолькоПросмотр = Ложь;
	Элементы.ФормаРазблокировать.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(Объект.Родитель) = Ложь Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выберите группу оборудования";
		Сообщение.Поле = "Объект.Родитель";
		Сообщение.Сообщить();	
		отказ = истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДиаметрПриИзменении(Элемент)
	Объект.РучКорДавления =Истина;
КонецПроцедуры


