
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.ЕдиницаИзмерения) = Ложь Тогда
		Объект.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ПолучитьЕдиницуИзмеренияПоУмолчанию();
	КонецЕСЛИ;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		 РучКорДавления = Ложь;
	КонецеСЛИ;
	
	ОтборПоРегСведений();
КонецПроцедуры

&НаСервере
Процедура ОтборПоРегСведений()
	Если ЗначениеЗаполнено(Объект.Ссылка)=ЛОжь Тогда Возврат; КонецЕСлИ;
	
	Поле = Новый ПолеКомпоновкиДанных("Оборудование");
	Для каждого Эл из регЦен.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ТипЗнч(Эл) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			
		ИНачеЕсли Эл.ЛевоеЗначение = Поле Тогда
			Эл.Использование = Истина;
			Эл.ПравоеЗначение = Объект.Ссылка;
			прервать;
		КонецеслИ;
	КонецЦикла;
	
	
	
КонецПроцедуры

&НаКлиенте
Функция УстановитьФлагФормироватьНаименованиеПолноеАвтоматически(НаименованиеПолное,Наименование)
   
   Возврат (ПустаяСтрока(НаименованиеПолное) ИЛИ НаименованиеПолное = Наименование);
   
КонецФункции // УстановитьФлагФормироватьНаименованиеПолноеАвтоматически()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЭтаФорма.ТолькоПросмотр = Истина;
КонецПроцедуры


&НаКлиенте
Процедура Разблокировать(Команда)
	ЭтаФорма.ТолькоПросмотр = Ложь;
	Элементы.ФормаРазблокировать.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(Объект.Родитель) = Ложь Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выберите группу оборудования";
		Сообщение.Поле = "Объект.Родитель";
		Сообщение.Сообщить();	
		отказ = истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДиаметрПриИзменении(Элемент)
	Объект.РучКорДавления =Истина;
КонецПроцедуры


