Функция ПолучитьМассивРаботПоПРайсу(ссКА,ссОбр) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ро_РаботыПоПрайсуРаботы.Работа КАК Работа
	               |ИЗ
	               |	РегистрСведений.РегистрЦен КАК РегистрЦен
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ро_РаботыПоПрайсу.Работы КАК ро_РаботыПоПрайсуРаботы
	               |		ПО РегистрЦен.Работа = ро_РаботыПоПрайсуРаботы.Ссылка
	               |ГДЕ
	               |	РегистрЦен.Контрагент = &Контрагент
	               |	И РегистрЦен.Оборудование = &Оборудование";
	Запрос.УстановитьПараметр("Контрагент",ссКА);
	Запрос.УстановитьПараметр("Оборудование",ссОбр);
	
	ТБл = Запрос.Выполнить().Выгрузить();
	ВозвраТ Тбл;
	
КонецФункции