#Область Печать

Функция ДанныеШапка(ссДок)
	
	Стк = Новый Структура();
	
	Стк.Вставить("Дата",Формат(ссДок.Дата,"ДФ=dd.MM.yyyy"));
	Стк.Вставить("дтМес",Формат(ссДок.Дата,"ДФ='MMMM yyyy'"));
	
	
	Стк.Вставить("Номер",СокрЛП(ссДок.Номер));
	Стк.вставить("ФИООтв",Справочники.ФизическиеЛица.ФИОстр(ссДок.Ответственный,ссДок.Ответственный));
	Стк.Вставить("Организация",ссДок.Организация);
	Стк.Вставить("Контрагент",ссДок.Контрагент.НаименованиеПолное);
	Стк.Вставить("Договор",ссДок.Договор);
	Стк.Вставить("ФИООрг",Справочники.ФизическиеЛица.ФИОстр(ссДок.КонтролерСТК));
	Стк.Вставить("ФИОКа",СокрЛП(ссДок.Подписант));
	
	Если ЗначениеЗаполнено(Стк.Договор) Тогда
		Стк.Вставить("ЗаголовокДоговор","Договор : ");
	КонецЕСЛИ;
	
	
	//Стк.вставить("АдресОтправителя",Справочники.Контрагенты.ПолучитьЮрАдрес(Стк.Организация));
	//Стк.вставить("АдресПолучателя",Справочники.Контрагенты.ПолучитьЮрАдрес(Стк.Контрагент));
	
	
	Возврат Стк;
	
КонецФункции

Функция Данные(сс)

	Запрос =Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ро_РеестрыЗаказНаряды.Цена КАК Цена,
	               |	ро_РеестрыЗаказНаряды.ЗаказНаряд КАК ЗаказНаряд,
	               |	ISNULL(СпрИмяКАНом.НаименованиеКА,ро_РеестрыЗаказНаряды.Оборудование.Наименование) КАК Оборудование,
	               |	ро_РеестрыЗаказНаряды.Оборудование.Диаметр КАК Диаметр,
	               |	ро_РеестрыЗаказНаряды.Оборудование.Давление КАК Давление,
				   //|	ро_РеестрыЗаказНаряды.НомерОборудования КАК НомерОборудования,
	               |	CASE WHEN ДокЗН.НомерОборудованияКор="""" THEN ДокЗН.НомерОборудования ELSE ДокЗН.НомерОборудованияКор END КАК НомерОборудования,
	               |	ро_РеестрыЗаказНаряды.ЗаказНаряд.Плательщик.Наименование КАК Плательщик,
	               |	ро_РеестрыЗаказНаряды.ЗаказНаряд.Производитель.Наименование КАК Производитель,
	               |	ро_РеестрыЗаказНаряды.ЗаказНаряд.Заключение.Наименование КАК Заключение,
	               |	ро_РеестрыЗаказНаряды.ЗаказНаряд.ДатаИспытания КАК ДатаИспытания,
	               |	ро_РеестрыЗаказНаряды.ЗаказНаряд.ИнвНомер КАК ИнвНомер,
	               |	ро_РеестрыЗаказНаряды.НомерЗаказНаряда КАК ЗаказНарядНомер,
	               |	1 КАК Кол,
	               |	ISNULL(СпрИмяКА.НаименованиеКА,ро_РеестрыЗаказНаряды.ЗаказНаряд.Оборудование.Родитель.Наименование) КАК Группа,
	               |	ро_РеестрыЗаказНаряды.ОписаниеПараметров КАК ОписаниеПараметров
	               |ИЗ
	               |	Документ.ро_Реестры.ЗаказНаряды КАК ро_РеестрыЗаказНаряды
				   |INNER JOIN Документ.ро_Реестры Док ON Док.ссылка = ро_РеестрыЗаказНаряды.ссылка
	               |LEFT OUTER JOIN Справочник.ро_Оборудование.НаименованиеДляКонтрагента СпрИмяКА ON СпрИмяКА.ссылка     = ро_РеестрыЗаказНаряды.ЗаказНаряд.Оборудование.Родитель
				   |                                                                                и СпрИмяКА.Контрагент = Док.контрагент
				   |
	               |LEFT OUTER JOIN Справочник.ро_Оборудование.НаименованиеДляКонтрагента СпрИмяКАНом ON СпрИмяКАНом.ссылка     = ро_РеестрыЗаказНаряды.ЗаказНаряд.Оборудование
				   |                                                                                   и СпрИмяКАНом.Контрагент = Док.контрагент
				   |
				   |INNER JOIN Документ.роЗаказНаряд ДокЗН ON ДокЗН.ссылка = ро_РеестрыЗаказНаряды.ЗаказНаряд
	               |LEFT OUTER JOIN Справочник.ро_Заключения СпрЗак ON СпрЗак.ссылка = ДокЗН.Заключение и СпрЗак.БезОплаты = истина
	               |
	               |ГДЕ
	               |	ро_РеестрыЗаказНаряды.Ссылка = &Ссылка
	               |  и СпрЗак.ссылка IS NULL
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Группа,
	               |	Оборудование";
	
	  Запрос.УстановитьПараметр("Ссылка",сс);
	  
	  Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПечатьРеестр(сс) Экспорт
	
	Макет = Документы.ро_Реестры.ПолучитьМакет("Реестр");
	
	ТБл = Данные(сс);
	сткШапка = ДанныеШапка(сс);
	
	Таб = Новый ТабличныйДокумент;
	Таб.КлючПараметровПечати = "роПечатьРеестр";
	Таб.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	Если Тбл.Количество()=0 ТОгда Возврат Таб; КонецЕсли;
	
	
	Обл = Макет.ПолучитьОбласть("Шапка");
	ОблТаб = Макет.ПолучитьОбласть("ШапкаТаб");
	Обл.Параметры.Заполнить(сткШапка);
	Таб.Вывести(Обл);
	
	
	ОблГр = Макет.ПолучитьОбласть("Группа");
	Обл   = Макет.ПолучитьОбласть("Строка");
	
	МАсОбл = Новый МАссив;
	МасОбл.Добавить(ОблГР);
	МасОбл.Добавить(Обл);
	
	Т = тбл.Скопировать();
	Т.свернуть("Группа,ОписаниеПараметров","Кол,Цена");
	Т.Сортировать("Группа,ОписаниеПараметров");
	Для каждого С из Т Цикл
		облГр.Параметры.Заполнить(С);
		
		Мас = Тбл.НайтиСтроки(Новый Структура("Группа,ОписаниеПараметров",С.Группа,с.ОписаниеПараметров));
		СткНом = Новый Структура("ном",0);
		Для каждого Стр из Мас Цикл
			сткНом.ном=сткНом.Ном+1;
			Обл.Параметры.Заполнить(Стр);
			Обл.Параметры.Заполнить(СткНом);
			Таб.Вывести(Обл);
			Если Таб.ПроверитьВывод(МасОбл)=Ложь Тогда
				Таб.ВывестиГоризонтальныйРазделительСтраниц();
				Таб.Вывести(облТаб);
			КонецЕСЛИ;
		КонецЦикла;
		
		Таб.Вывести(облГр);
		
	КонецЦикла;
	
	Обл = Макет.ПолучитьОбласть("Итого");
	Обл.Параметры.Заполнить(сткШапка);
	Т.свернуть("","Кол,Цена");
	Обл.Параметры.Заполнить(Т[0]);
	
	
	Таб.Вывести(Обл);
	Таб.ТолькоПросмотр = Истина;
	Таб.ОтображатьГруппировки = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОтображатьСетку = Ложь;
	
	Возврат Таб;
	
	
	
	
КонецФункции

Функция ПечатьРеестрСвод(сс,ссКА) Экспорт

	Макет = НайтиМакетРеестра(ссКА);
	МасКол = Справочники.ПечатныеФормы.ПолучитьМассивПараметров(Макет.ПолучитьОбласть("Строка"));
	
	СтрСвр = "";
	СтрСврНомОбр = "";
	СткНомОбр = Новый Структура;
	ЕстьНомОбр=Ложь;
	Для каждого эл из МасКол Цикл
		Если нрег(Эл)="кол" или нрег(Эл)="ном" или нрег(Эл)="сумма"  Тогда  Продолжить; КонецЕсли;
		СтрСвр = СтрСвр+","+Эл;
		
		
		Если  нрег(Эл)="номероборудованиясписок"
			или нрег(Эл)="заказнарядномерсписок"  Тогда
			ЕстьНомОбр = Истина;
		ИНаче
			СтрСврНомОбр = СтрСврНомОбр+","+Эл;
			СткНомОбр.Вставить(Эл);
		КонецЕсли;
		
	КонецЦикла;
	СтрСвр 		 = Сред(СтрСвр,2);
	СтрСврНомОбр = Сред(СтрСврНомОбр,2);
	
	сткШапка = ДанныеШапка(сс);
	Тбл = Данные(сс);
	
	
	Если  ЕстьНомОбр=Истина Тогда
		
		Тбл.Колонки.Добавить("НомерОборудованияСписок");
		Тбл.Колонки.Добавить("ЗаказНарядНомерСписок");
		
		Т = Тбл.Скопировать(,СтрСврНомОбр);
		Т.Свернуть(СтрСврНомОбр,"");
		Для каждого С из Т Цикл
			ЗаполнитьЗначенияСвойств(СткНомОбр,с);
			Мас = Тбл.НайтиСтроки(СткНомОбр);
			пСтр = "";
			пЗак = "";
			Для каждого Эл из Мас Цикл
				пСтр = пСтр + ", "+СокрлП(эл.НомерОборудования);
				пЗак = пЗак + ", "+СокрлП(эл.ЗаказНарядНомер);
			КонецЦикла;
			пСтр = Сред(пСтр,3);
			пЗак = Сред(пЗак,3);
			
			Для каждого Эл из Мас Цикл
				Эл.НомерОборудованияСписок = пСтр;
				Эл.ЗаказНарядНомерСписок = пЗак;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕСлИ;
	
	
	
	Тбл.Свернуть(СтрСвр,"Кол");
	Тбл.Колонки.Добавить("Сумма",Новый ОПисаниеТипов("Число"));
	
	
	Таб = Новый ТабличныйДокумент;
	Таб.КлючПараметровПечати = "роПечатьРеестрСвод";
	Если Тбл.Количество()=0 ТОгда Возврат Таб; КонецЕсли;
	
	
	Обл = Макет.ПолучитьОбласть("Шапка");
	ОблТаб = Макет.ПолучитьОбласть("ШапкаТаб");
	Обл.Параметры.Заполнить(сткШапка);
	Таб.Вывести(Обл);
	
	
	Обл   = Макет.ПолучитьОбласть("Строка");
	
	СткНом = Новый Структура("ном",0);
	Для каждого Стр из Тбл Цикл
		Стр.Сумма = Стр.Цена * Стр.Кол;
		
		сткНом.ном=сткНом.Ном+1;
		Обл.Параметры.Заполнить(Стр);
		Обл.Параметры.Заполнить(СткНом);
		Таб.Вывести(Обл);
		
	КонецЦикла;
	
	ОблИтог = Макет.ПолучитьОбласть("Итого");
	ОблИтог.Параметры.Заполнить(сткШапка);
	Тбл.свернуть("","Кол,Сумма");
	ОблИтог.Параметры.Заполнить(Тбл[0]);
	Таб.Вывести(ОблИтог);
	
	Таб.ТолькоПросмотр = Истина;
	Таб.ОтображатьГруппировки = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОтображатьСетку = Ложь;
	
	Возврат Таб;
	
	
КонецФункции	

Функция НайтиМакетРеестра(ссКА)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ TOP 1
	               |	КонтрагентыПечатныеФормы.ПечФорма КАК ПечФорма
	               |ИЗ
	               |	Справочник.Контрагенты.ПечатныеФормы КАК КонтрагентыПечатныеФормы
	               |ГДЕ
	               |	КонтрагентыПечатныеФормы.Ссылка = &Ссылка
	               |	И КонтрагентыПечатныеФормы.ИспользоватьВДокументах = Значение(Перечисление.ВидыДокументовДЛяПечФорм.Реестр) ";
	Запрос.УстановитьПараметр("Ссылка",ссКА);
	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда
		
		
		ДвоичныеДанные = Выб.Печформа.хрОбработкаПечати.Получить();
		Поток = ДвоичныеДанные.ОткрытьПотокДляЧтения();
		Макет = Новый ТабличныйДокумент;
		Макет.Прочитать(Поток);
		Поток.Закрыть();
		
		Возврат Макет;
	КонецЕсли;
	
	Возврат  Документы.ро_Реестры.ПолучитьМакет("РеестрСвод");
	
КонецФункции

Функция ПечатьНакладная(Мас,Макет,ссПечФормы=Неопределено) Экспорт

	Возврат Справочники.ПечатныеФормы.ПечатьНакладная(Мас,Макет,ссПечФормы);
	
КонецФункции	
	
#КонецОбласти


Функция ПолучитьЦенуИзПрайса(Дт,КА,Обр) Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |    ISNULL(Рег.Цена,0) Цена
	               |ИЗ
	               |	Справочник.ро_Оборудование Спр 
				   |LEFT OUTER JOIN РегистрСведений.Прайс.СрезПоследних(&Дт) Рег ON Рег.Контрагент = &КА
				   |                                           и Рег.Оборудование  = Спр.родитель 
				   |                                           и (Рег.ДиаметрОт   <= Спр.Диаметр  или Рег.ДиаметрОт = 0)
				   |                                           и (Рег.ДиаметрДо   >= Спр.Диаметр  или Рег.ДиаметрДо = 0)
				   |                                           и (Рег.ДавлениеОт  <= Спр.Давление или Рег.ДавлениеОт = 0)
				   |                                           и (Рег.ДавлениеДо  >= Спр.Давление или Рег.ДавлениеДо = 0)
				   |WHERE Спр.ссылка = &Обр
	               |";
	
	Запрос.УстановитьПараметр("Дт",Дт);
	Запрос.УстановитьПараметр("КА",КА);
	Запрос.УстановитьПараметр("Обр",Обр);
	
	Выб = Запрос.Выполнить().Выбрать();
	ЕСли Выб.Следующий() ТОгда
		Рез = Выб.Цена;
	Иначе
		Рез =Неопределено ;
	КонецЕСЛИ;
	
	Возврат Рез;
	
КонецФункции