
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЗначениеЗаполнено(Ответственный) = Ложь Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕСЛИ;
	
	КоличествоПозиций =  ЗаказНаряды.Количество();
	СуммаДокумента = ЗаказНаряды.Итог("Цена");
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Организация)=Ложь Тогда
		Организация = Константы.ОсновнаяОрганизация.Получить();
	КонецЕСЛИ;
	
	Если ЗначениеЗаполнено(Ответственный) = Ложь Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕСЛИ;

КонецПроцедуры


Процедура ДвиженияРабота(Отказ)
	
	Запрос =новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |  ЗаказНаряд,
				   |  ппНомерОборудования,
				   |  Оборудование,
				   |  SUM(КолОстаток) КолОстаток
				   |FROM (
				   |SELECT
	               |	ОстатокРООстатки.ЗаказНаряд КАК ЗаказНаряд,
	               |	ОстатокРООстатки.КолОстаток КАК КолОстаток,
	               |	ОстатокРООстатки.ппНомерОборудования КАК ппНомерОборудования,
	               |	ОстатокРООстатки.Оборудование КАК Оборудование
	               |ИЗ
	               |	РегистрНакопления.РаботаРО.Остатки(, ЗаказНаряд В (&Мас)) КАК ОстатокРООстатки
				   |
				   |UNION ALL
				   |
				   |ВЫБРАТЬ
	               |	ОстатокРО.ЗаказНаряд КАК ЗаказНаряд,
	               |	ОстатокРО.Кол КАК КолОстаток,
	               |	ОстатокРО.ппНомерОборудования КАК ппНомерОборудования,
	               |	ОстатокРО.Оборудование КАК Оборудование
	               |ИЗ
	               |	РегистрНакопления.РаботаРО  КАК ОстатокРО
				   |WHERE
				   |   ЗаказНаряд В (&Мас)
				   |  и  ОстатокРО.Регистратор = &сс
				   |) WWW
				   |
				   |GROUP BY
				   |  ЗаказНаряд,
				   |  ппНомерОборудования,
				   |  Оборудование
				   |
				   |";
	
	
	Запрос.УстановитьПараметр("сс",ссылка);
	Запрос.УстановитьПараметр("Дт",Дата);
	Запрос.УстановитьПараметр("Мас",ЗаказНаряды.ВыгрузитьКолонку("ЗаказНаряд"));
	
	ТБл = Запрос.Выполнить().Выгрузить();
	
	СткФлт = новый Структура("ЗаказНаряд,ппНомерОборудования,Оборудование");
	
	Для каждого Стр из ЗаказНаряды Цикл
		
		ЗаполнитьЗначенияСвойств(СткФлт,Стр);
		
		масНС = Тбл.НайтиСтроки(СткФлт);
		Кол =1;
		
		Если МасНС.Количество()=0 или масНс[0].КолОстаток<>Кол ТОгда
			Сообщить("Заказ-наряд № "+Стр.ЗаказНаряд.Номер+" "+Стр.ЗаказНаряд.Оборудование+" нет в отгрузке!");
			отказ=Истина;
			Продолжить;
		КонецеСЛИ;
		
		НовЗап = Движения.РаботаРО.Добавить();
		НовЗап.ВидДвижения=ВидДвиженияНакопления.Расход;
		новЗап.Период = Дата;
		новЗап.ЗаказНаряд = Стр.ЗаказНаряд;
		новЗап.Оборудование = Стр.Оборудование;
		новЗап.ппНомерОборудования = Стр.ппНомерОборудования;
		новЗап.Цена = Стр.Цена;
		новЗап.кол = Кол;
		
	КонецЦикла;
	
	Движения.РаботаРО.Записать();
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ДвиженияРабота(Отказ);
КонецПроцедуры

