&НаКлиенте
Перем начТекущаяДата;

&НаКлиенте
Процедура Подбор(Команда)
	Если ЗначениеЗаполнено(ОБъект.Контрагент) = Ложь ТОгда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не выбран контрагент ";
		Сообщение.Поле = "Контрагент";
		
		// Привязка объекта к реквизиту формы "вручную"
		Сообщение.КлючДанных = Объект.Ссылка;
		Сообщение.ПутьКДанным = "Объект";
		
		// Сообщение выводится пользователю
		Сообщение.Сообщить();
		Возврат;
	КонецЕСлИ;
	
	Стк = новый Структура();
	Стк.Вставить("Статус","Готово");
	Стк.Вставить("Контрагент",Объект.Контрагент);
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораЗаказНарядов",Стк,ЭтаФорма,ЭтаФорма,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) <> ТИп("Массив") Тогда Возврат; КонецЕСЛИ;
	Для каждого эл из ВыбранноеЗначение Цикл
		мас = Объект.ЗаказНаряды.НайтиСтроки(Новый Структура("ЗаказНаряд",Эл));
		Если Мас.Количество()<>0 Тогда Продолжить; КонецЕсли;
		
		ОБъект.ЗаказНаряды.Добавить().ЗаказНАряд = Эл;	
	КонецЦикла;

КонецПроцедуры

&НасервереБезКонтекста
Функция ПечатныеФормыНаСервере(ссДок,Имя)
	Если ЗначениеЗаполнено(ссДОк)=Ложь Тогда Возврат Неопределено; КонецЕсли; 
	
	Если Имя = "ТТН" Тогда
		имя = Имя+" "+ссДок.Номер;
		Возврат Документы.ро_Отгрузка.ПечатьТТН(ссДок);
	ИНачеЕсли Имя = "ТТНЦепочка" Тогда
		имя = Имя+" "+ссДок.Номер;
		Возврат Документы.ро_Отгрузка.ПечатьТТН(ссДок,Истина);
	ИНАче
		Возврат Справочники.ПечатныеФормы.ПечатьПоКодуФормы(ссДок,Имя);
	КонецЕСЛИ;
	
КонецФункции

&НаКлиенте
Процедура Печать(Команда) Экспорт
	
	Если ОбщийКлиент.ПроверкаМодифицированности(ЭтаФорма,команда)=Ложь Тогда Возврат; КонецЕсли;
	
	ИмяКодМакета = СокрЛП(Команда.Имя);
	Таб = ПечатныеФормыНаСервере(Объект.Ссылка,ИмяКодМакета);
	Если Таб = Неопределено Тогда Возврат; КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ФормаПечати",Новый Структура("Результат,Заголовок",Таб,ИмяКодМакета),,Новый УникальныйИдентификатор());
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Ссылка)=Ложь ТОгда
		Объект.ЛогПроверил = "";
	КонецЕсли;
	
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	Справочники.ПечатныеФормы.ДобавитьКнопкиПечати(ЭтаФорма,Объект.Контрагент,Перечисления.ВидыДокументовДЛяПечФорм.Расход);
КонецПроцедуры

&НаСервереБезКонтекста
Функция Контрагент_Реквизиты(сс)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.ПунктПогрузки КАК ПунктПогрузки,
	               |	Контрагенты.Подписант КАК Подписант,
	               |	Контрагенты.ПодписантДолжность КАК ПодписантДолжность
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Сс);
	Тбл = Запрос.Выполнить().Выгрузить();
	
	Стк = Новый Структура;
	Для каждого Кол из ТБл.Колонки Цикл
		Стк.вставить(Кол.имя,ТБл[0][Кол.имя]);
	Конеццикла;
	
	
	Возврат Стк;
	
КонецФункции

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
	Стк = Контрагент_Реквизиты(Объект.Контрагент);
	Если ЗначениеЗаполнено(Объект.ПунктРазгрузки)=ложь Тогда
		Объект.ПунктРазгрузки = Стк.ПунктПогрузки;
	КонецЕСЛИ;
	Объект.Подписант = Стк.Подписант;
	Объект.ПодписантДолжность = Стк.ПодписантДолжность;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПЛ(Команда)
	открытьФорму("Документ.ро_Отгрузка.Форма.ФормаЗагрузкаПЛ",,ЭтаФорма,ЭтаФорма,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(Объект.ПунктРазгрузки) Тогда
		Мас = новый Массив;
		Мас.Добавить(Объект.Контрагент);
		Мас.Добавить(Объект.ПунктРазгрузки);
		ФоновыеЗадания.Выполнить("глСервер.ПроставитьПунктПогрузки",Мас);
	КонецЕсли;
КонецПроцедуры


&НаСервереБезКонтекста
Функция ГосНомерОкончаниеВводаТекстаНаСервере(Текст)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СпрТС.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ТС КАК СпрТС
	               |ГДЕ
	               |	СпрТС.Код = &Код";
	
   Запрос.УстановитьПараметр("Код",Текст);
   Мас= Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
   Спк = новый СписокЗначений;
   Спк.ЗагрузитьЗначения(Мас);
   Возврат Спк;
   
	
КонецФункции


&НаКлиенте
Процедура ГосНомерОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ДанныеВыбора = ГосНомерОкончаниеВводаТекстаНаСервере(Текст);
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТС(сс)
	
	   Стк = Новый Структура("ГосНомер,ТС,ВодительФИО,Перевозчик,АдресПеревозчика");
	   ЗаполнитьЗначенияСвойств(Стк,Сс);
	   
	   Стк.Вставить("ДатаПЛ",ТекущаяДАта());
	   
	   Возврат Стк;
	
КонецФункции

&НаКлиенте
Процедура ГосНомерОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Стк = ПолучитьТС(ВыбранноеЗначение);
		ЗаполнитьЗначенияСвойств(Объект,Стк);
	КонецЕСЛИ;
	СтандартнаяОбработка = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьАвто(Команда)
	оо = новый ОписаниеОповещения("ПослеВводаНовогоТС",ЭтотОбъект);
	
	Парам = Новый Структура("сс");
	
	ОткрытьФорму("Справочник.ТС.Форма.ФормаЭлемента",Парам,Этаформа,ЭтаФорма,,,оо,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте 
Процедура ПослеВводаНовогоТС(РезультатЗакрытия,Параметры) Экспорт
	ГосНомерОбработкаВыбора(Неопределено, РезультатЗакрытия, Ложь);
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьСправочникТС(Команда)
		ОткрытьФорму("Справочник.ТС.ФормаСписка");
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивИзСсылки(сс)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ро_Отгрузка.ЗаказНаряд КАК ЗаказНаряд
	               |ИЗ
	               |	Документ.ро_Отгрузка.ЗаказНаряды КАК ро_Отгрузка
	               |ГДЕ
	               |	ро_Отгрузка.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",сс);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЗаказНаряд");
	
КонецФункции
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		МасСс = ПолучитьМассивИзСсылки(Объект.Ссылка);
		Для каждого Стр из Объект.ЗаказНаряды Цикл
			п = масСС.НАйти(Стр.ЗаказНаряд);
			Если п=Неопределено ТОгда
				массс.Добавить(1);
				прервать;
			КонецЕСЛИ;
			массс.удалить(п);
		Конеццикла;
		ЕстьИзменения = масСС.Количество()<>0;
	ИНаче
		ЕстьИзменения=Истина;
		ВремяОбработкиДокумента = 0;
	КонецЕсли;
	
	Если ЕстьИзменения Тогда
		Объект.ВремяОбработкиДокумента = Объект.ВремяОбработкиДокумента + (ТекущаяДата()-начТекущаяДата);
		начТекущаяДата = ТекущаяДата();
	КонецЕсли;
	

КонецПроцедуры

&НасервереБезКонтекста
Функция срРольДоступна()
	
	Возврат РольДоступна("изменятьЦены");
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОтображениеПроверил();
	Элементы.ФлагПроверил.Доступность=срРольДоступна();
	Если ФлагПроверил и  Элементы.ФлагПроверил.Доступность=Ложь Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецеСЛИ;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПроверил()
	
	ФлагПроверил = Объект.ЛогПроверил<>"";
	Если ФлагПроверил Тогда
		Элементы.ФлагПроверил.Заголовок = "Проверил: "+Объект.ЛогПроверил;
	ИНаче
		Элементы.ФлагПроверил.Заголовок = "Проверил";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФлагПроверилПриИзменении(Элемент)
	Если ФлагПроверил Тогда
		Объект.ЛогПроверил = ""+ИмяПользователя()+"-"+ТекущаяДата();
	ИНаче
		Объект.ЛогПроверил = "";
	КонецеСЛИ;
	ОтображениеПроверил();
КонецПроцедуры



