

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элемент.ТекущийЭлемент.Имя = "Статус" Тогда
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьФильтрСписка()
	
	испСтатус = ЗначениеЗаполнено(фильтрСтатус);
	Поле = Новый ПолеКомпоновкиДанных("Статус");
	ПолеКА = Новый ПолеКомпоновкиДанных("Контрагент");
	Для каждого Эл из Список.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ТипЗнч(Эл) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			
		ИНачеЕсли Эл.ЛевоеЗначение = Поле Тогда
			Эл.Использование = ЗначениеЗаполнено(фильтрСтатус);
			Эл.ПравоеЗначение = фильтрСтатус;
		ИНачеЕсли Эл.ЛевоеЗначение = ПолеКА Тогда
			Эл.Использование = ЗначениеЗаполнено(фильтрКонтрагент);
			Эл.ПравоеЗначение = фильтрКонтрагент;
		КонецеслИ;
	КонецЦикла;
	
	
КонецПроцедуры


&НаКлиенте
Процедура фильтрСтатусПриИзменении(Элемент)
	УстановитьФильтрСписка();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	фильтрСтатус = Справочники.ро_Статусы.ВРаботе;
	УстановитьФильтрСписка();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПечатьКарточкиНаСервере(Мас)

	Возврат Документы.роЗаказНаряд.ПечатьКарточки(Мас);
	
КонецФункции

&НаКлиенте
Процедура ПечатьКарточки(Команда)
	Мас = Элементы.список.ВыделенныеСтроки;
	Таб = ПечатьКарточкиНаСервере(Мас);
	
	ОткрытьФорму("ОбщаяФорма.ФормаПечати",Новый Структура("Результат,Заголовок",Таб,"Карточки"),,Новый УникальныйИдентификатор());
	//Таб.показать();
КонецПроцедуры

#Область СменаСтатуса

&НаКлиенте
Процедура СменитьСтатус(Команда)
	
	Стк = новый Структура();
	Стк.Вставить("Статус","ВРаботе");
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораЗаказНарядов",Стк,ЭтаФорма,ЭтаФорма,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СменитьСтатусНаСервере(МАс)
	
	Для каждого Эл из Мас Цикл
		Обк = Эл.ПолучитьОБъект();
		Обк.статус = Справочники.ро_Статусы.Готово;
		Попытка
			Обк.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) <> ТИп("Массив") Тогда Возврат; КонецЕСЛИ;
	СменитьСтатусНаСервере(ВыбранноеЗначение);
	ОповеститьОбИзменении(ВыбранноеЗначение[0])
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтгрузку(Команда)
	ОткрытьФорму("Документ.ро_Отгрузка.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Отчет(Команда)
	ОткрытьФорму("Отчет.ОтчетПоЗаказам.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПриход(Команда)
	ОткрытьФорму("Документ.ро_ПриходОборудования.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Испытания(Команда)
	ОткрытьФорму("Документ.роЗаказНаряд.Форма.ФормаИспытания");
КонецПроцедуры

&НаКлиенте
Процедура СправочникОборудование(Команда)
	ОткрытьФорму("Справочник.ро_Оборудование.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Реестры(Команда)
	ОткрытьФорму("Документ.ро_Реестры.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОтчетОборудованиеВРаботе(Команда)
	ОткрытьФорму("Отчет.ОтчетПоОборудованиеВРаботе.Форма");
КонецПроцедуры

&НаКлиенте
Процедура СправочникПечатныеФормы(Команда)
	ОткрытьФорму("Справочник.ПечатныеФормы.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура АктЗаМесяц(Команда)
	ОткрытьФорму("Отчет.АктЗаМесяц.Форма");
КонецПроцедуры

&НаКлиенте
Процедура СправочникКонтрагенты(Команда)
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаСписка1");
КонецПроцедуры

&НаКлиенте
Процедура Методичка(Команда)
	оо = новый ОписаниеОповещения("МетодичкаПосле",ЭтотОбъект);
НачатьЗапускПриложения(оо,"https://sites.google.com/view/urals1c/%D0%B7%D0%B0%D0%BA%D0%B0%D0%B7-%D0%BD%D0%B0%D1%80%D1%8F%D0%B4%D1%8B");
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура  МетодичкаПосле(Рез=Неопределено,Пар=Неопределено) Экспорт
	
КонецПроцедуры

#КонецОбласти