
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЗначениеЗаполнено(Ответственный) = Ложь Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕСЛИ;
	
	Если ДатаИспытания<>Дата(1,1,1) и  ссылка.Статус = Справочники.ро_Статусы.ВРаботе Тогда
		 Статус = Справочники.ро_Статусы.Готово;
		 ЛогСТК = ""+ТекущаяДата()+" "+ИмяПользователя()+" "+ИмяКомпьютера();
	 КонецеСЛИ;
	 
	 Организация = Контрагент;
	 Если РежимЗаписи = РежимЗаписиДокумента.Запись и ДатаИспытания<>Дата(1,1,1) Тогда
		 РежимЗаписи = РежимЗаписиДокумента.Проведение;
	 КонецЕСлИ;
	 
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Ответственный) = Ложь Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕСЛИ;
	
	Заключение = Справочники.ро_Заключения.ЭлементПоУмолчанию();
	ВыявленныеДефекты = Справочники.ро_Дефекты.ЭлементПоУмолчанию();
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Если СокрлП(Контрагент.Префикс)<>"" Тогда
		ПРефикс = Контрагент.Префикс;
	ИНАче
		ПРефикс = "00";
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Дата < Дата(2021,1,1) Тогда Возврат; КонецЕсли;
	ДвиженияРаботаРО(Отказ);
КонецПроцедуры



Процедура ДвиженияРаботаРО(Отказ)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	роЗаказНаряд.ссылка КАК ЗаказНаряд,
	               |	роЗаказНаряд.Оборудование КАК Оборудование,
	               |	роЗаказНаряд.ДатаИспытания КАК Период,
				   |    0 ппНомерОборудования,
	               |	1 КАК Кол
	               |ИЗ
	               |	Документ.роЗаказНаряд КАК роЗаказНаряд
	               |ГДЕ
	               |	роЗаказНаряд.Ссылка = &Ссылка
				   | и  роЗаказНаряд.ДатаИспытания <> ДатаВремя(1,1,1)
				   |
				   |UNION ALL
				   |
				   |ВЫБРАТЬ
	               |	роЗаказНаряд.ссылка КАК ЗаказНаряд,
	               |	Спр.ссылка КАК Оборудование,
	               |	роЗаказНаряд.ДатаИспытания КАК Период,
				   |    1 ппНомерОборудования,
	               |	1 КАК Кол
	               |ИЗ
	               |	Документ.роЗаказНаряд КАК роЗаказНаряд
				   |INNER JOIN Справочник.ро_Оборудование Спр ON Спр.ссылка = роЗаказНаряд.ТипДопОбр
	               |ГДЕ
	               |	роЗаказНаряд.Ссылка = &Ссылка
				   | и  роЗаказНаряд.ДатаИспытания <> ДатаВремя(1,1,1)
				   |
				   |UNION ALL
				   |
				   |ВЫБРАТЬ
	               |	роЗаказНаряд.ссылка КАК ЗаказНаряд,
	               |	Спр.ссылка КАК Оборудование,
	               |	роЗаказНаряд.ДатаИспытания КАК Период,
				   |    2 ппНомерОборудования,
	               |	1 КАК Кол
	               |ИЗ
	               |	Документ.роЗаказНаряд КАК роЗаказНаряд
				   |INNER JOIN Справочник.ро_Оборудование Спр ON Спр.ссылка = роЗаказНаряд.ТипДопОбр1
	               |ГДЕ
	               |	роЗаказНаряд.Ссылка = &Ссылка
				   | и  роЗаказНаряд.ДатаИспытания <> ДатаВремя(1,1,1)
				   |
				   |";
	
	Запрос.УстановитьПараметр("ссылка",Ссылка);
	ТБл = Запрос.Выполнить().Выгрузить();
	
	Движения.РаботаРО.Загрузить(Тбл);
	Движения.РаботаРО.Записать();
	
КонецПроцедуры

