
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЗначениеЗаполнено(Ответственный) = Ложь Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕСЛИ;
	
	КоличествоПозиций =  ЗаказНаряды.Количество();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Организация)=Ложь Тогда
		Организация = Константы.ОсновнаяОрганизация.Получить();
	КонецЕСЛИ;
	Если ЗначениеЗаполнено(ПунктПогрузки) = Ложь Тогда
		Склад = Организация.ПунктПогрузки;
	КонецЕСЛИ;
	Если ЗначениеЗаполнено(Ответственный) = Ложь Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕСЛИ;
	ЕСли СокрЛП(СопроводительныеДокументы)="" Тогда
		СопроводительныеДокументы = "Паспорта";
	КонецЕслИ;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Проведен = Ложь Тогда Возврат; КонецЕсли;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	роЗаказНаряд.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.роЗаказНаряд КАК роЗаказНаряд
	               |ГДЕ
	               |	роЗаказНаряд.Ссылка В(&Ссылка)
	               |	И роЗаказНаряд.Статус <> &Статус";
	Запрос.УстановитьПараметр("Ссылка",ЗаказНаряды.ВыгрузитьКолонку("ЗаказНаряд"));
	Запрос.УстановитьПараметр("Статус",Справочники.ро_Статусы.Закрыт);
	
	Тбл = Запрос.Выполнить().Выгрузить();
	Для каждого Стр из ТБл Цикл
		Обк = Стр.ссылка.ПолучитьОбъект();
		Обк.ДокОтгрузки = ссылка;
		Обк.Статус = Справочники.ро_Статусы.Закрыт;
		Обк.ЛогОтгрузки = ""+ТекущаяДАта()+" "+ИмяПользователя()+" "+ИмяКомпьютера();
		Обк.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Дата < Дата(2021,1,1) Тогда Возврат; КонецЕсли;
	
	ДвиженияОстатки(Отказ);
	//ДвиженияРаботаРО(Отказ);
	
КонецПроцедуры

Процедура ДвиженияРаботаРО(Отказ)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ро_ОтгрузкаЗаказНаряды.ЗаказНаряд КАК ЗаказНаряд,
	               |	ро_ОтгрузкаЗаказНаряды.ЗаказНаряд.Оборудование КАК Оборудование,
	               |	ро_ОтгрузкаЗаказНаряды.Ссылка.Дата КАК Период,
				   |    0 ппНомерОборудования,
	               |	1 КАК Кол
	               |ИЗ
	               |	Документ.ро_Отгрузка.ЗаказНаряды КАК ро_ОтгрузкаЗаказНаряды
	               |ГДЕ
	               |	ро_ОтгрузкаЗаказНаряды.Ссылка = &Ссылка
				   | и  ро_ОтгрузкаЗаказНаряды.ЗаказНаряд.ВключитьВРеестр = Ложь
				   |
				   |UNION ALL
				   |
				   |ВЫБРАТЬ
	               |	ро_ОтгрузкаЗаказНаряды.ЗаказНаряд КАК ЗаказНаряд,
	               |	Спр.ссылка КАК Оборудование,
	               |	ро_ОтгрузкаЗаказНаряды.Ссылка.Дата КАК Период,
				   |    1 ппНомерОборудования,
	               |	1 КАК Кол
	               |ИЗ
	               |	Документ.ро_Отгрузка.ЗаказНаряды КАК ро_ОтгрузкаЗаказНаряды
				   |INNER JOIN Справочник.ро_Оборудование Спр ON Спр.ссылка = ро_ОтгрузкаЗаказНаряды.ЗаказНаряд.ТипДопОбр
	               |ГДЕ
	               |	ро_ОтгрузкаЗаказНаряды.Ссылка = &Ссылка
				   | и  ро_ОтгрузкаЗаказНаряды.ЗаказНаряд.ВключитьВРеестр = Ложь
				   |
				   |UNION ALL
				   |
				   |ВЫБРАТЬ
	               |	ро_ОтгрузкаЗаказНаряды.ЗаказНаряд КАК ЗаказНаряд,
	               |	Спр.ссылка КАК Оборудование,
	               |	ро_ОтгрузкаЗаказНаряды.Ссылка.Дата КАК Период,
				   |    2 ппНомерОборудования,
	               |	1 КАК Кол
	               |ИЗ
	               |	Документ.ро_Отгрузка.ЗаказНаряды КАК ро_ОтгрузкаЗаказНаряды
				   |INNER JOIN Справочник.ро_Оборудование Спр ON Спр.ссылка = ро_ОтгрузкаЗаказНаряды.ЗаказНаряд.ТипДопОбр1
	               |ГДЕ
	               |	ро_ОтгрузкаЗаказНаряды.Ссылка = &Ссылка
				   | и  ро_ОтгрузкаЗаказНаряды.ЗаказНаряд.ВключитьВРеестр = Ложь
				   |
				   |";
	
	Запрос.УстановитьПараметр("ссылка",Ссылка);
	ТБл = Запрос.Выполнить().Выгрузить();
	
	Движения.РаботаРО.Загрузить(Тбл);
	Движения.РаботаРО.Записать();
	
КонецПроцедуры


Процедура ДвиженияОстатки(Отказ)
	
	Запрос =новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |  ЗаказНаряд,
				   |  SUM(КолОстаток) КолОстаток
				   |FROM
				   |(
				   |ВЫБРАТЬ
	               |	ОстатокРООстатки.ЗаказНаряд КАК ЗаказНаряд,
	               |	ОстатокРООстатки.КолОстаток КАК КолОстаток
	               |ИЗ
	               |	РегистрНакопления.ОстатокРО.Остатки(, ЗаказНаряд В (&Мас)) КАК ОстатокРООстатки
				   |
				   |UNION ALL
				   |
				   |ВЫБРАТЬ
	               |	ОстатокРО.ЗаказНаряд КАК ЗаказНаряд,
	               |	ОстатокРО.Кол КАК КолОстаток
	               |ИЗ
	               |	РегистрНакопления.ОстатокРО КАК ОстатокРО
				   |WHERE
				   |    ЗаказНаряд В (&Мас)
				   | и  ОстатокРО.Регистратор = &сс
				   |) WWW
				   |GROUP BY ЗаказНаряд
				   |";
	
	
	Запрос.УстановитьПараметр("сс",Ссылка);
	Запрос.УстановитьПараметр("Мас",ЗаказНаряды.ВыгрузитьКолонку("ЗаказНаряд"));
	
	ТБл = Запрос.Выполнить().Выгрузить();
	
	Для каждого Стр из ЗаказНаряды Цикл
		
		нс = Тбл.Найти(Стр.ЗаказНаряд,"ЗаказНаряд");
		Кол =1;
		
		ЕСли нс=Неопределено или нс.КолОстаток<>Кол Тогда
			Сообщить("Заказ-наряд № "+Стр.ЗаказНаряд.Номер+" "+Стр.ЗаказНаряд.Оборудование+" нет на остатке!");
			отказ=Истина;
			Продолжить;
		КонецеСЛИ;
		
		НовЗап = Движения.ОстатокРО.Добавить();
		НовЗап.ВидДвижения=ВидДвиженияНакопления.Расход;
		новЗап.Период = Дата;
		новЗап.ЗаказНаряд = Стр.ЗаказНаряд;
		новЗап.кол = Кол;
		
	КонецЦикла;
	
	Движения.ОстатокРО.Записать();
	
КонецПроцедуры