
Процедура ПередЗаписью(Отказ)
	// Вставить содержимое обработчика.
	//Если СокрЛП(НаименованиеДляТТН)="" Тогда
	//	НаименованиеДляТТН = Наименование;
	//КонецЕсли;
	Если СокрЛП(НаименованиеПолное)="" Тогда
		НаименованиеПолное = Наименование;
	КонецЕсли;
	
	Т = КонтактнаяИнформация.Выгрузить(,"Тип");
	Т.Колонки.Добавить("Инд",Новый ОписаниеТипов("Число"));
	Т.ЗаполнитьЗначения(1,"Инд");
	Т.Свернуть("Тип","Инд");
	Для каждого Стр из Т Цикл
		Если Стр.Инд> 1 Тогда
			Сообщить("Тип контактной информации: "+Стр.Тип+" использован более одного раза!");
			отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
