
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.ссылка)=Ложь ТОгда
		//Отказ = Истина;
	КонецЕСЛИ;
	
	
	
	СтрПоиска = Объект.КолонкиСкрытыеПриход;
	Для каждого МЕта из Метаданные.Документы.ро_ПриходОборудования.ТабличныеЧасти.Оборудования.Реквизиты Цикл
		Если Мета.Комментарий = "-" Тогда 
		ИНачеЕсли Найти(СтрПоиска,","+Мета.Имя+",")<>0 Тогда
			спкКолонок.Добавить(Мета.Имя,Мета.синоним,Ложь);
		ИНаче
			спкКолонок.Добавить(Мета.Имя,Мета.синоним,Истина);
		КонецЕсли;
	КонецЦикла;
	
	МетаИмя = "ОборудованиеКодR3";
	Если Найти(СтрПоиска,","+МетаИмя+",")<>0 Тогда
		спкКолонок.Добавить(МетаИмя,МетаИмя,Ложь);
	ИНаче
		спкКолонок.Добавить(МетаИмя,МетаИмя,Истина);
	КонецЕсли;

	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьДанныеНаСервере(сс)
	Справочники.Контрагенты.ЗагрузитьКА(сс.УникальныйИдентификатор());
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	ОбновитьДанныеНаСервере(Объект.Ссылка);
	ЭтаФорма.Прочитать();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтризСпк(спкКолонок)
	
	Стр = ",";
	Для каждого эл из спкКолонок Цикл
		Если эл.Пометка = Ложь Тогда
			Стр = Стр+эл.Значение+",";
		КонецЕСЛИ;
	КонецЦикла;
	
	Возврат Стр;
	
КонецФункции


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.КолонкиСкрытыеПриход = ПолучитьСтризСпк(спкКолонок);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЭлементНаСервере()
	
	Обк = РеквизитФормыВЗначение("Объект");
	Обк.КолонкиСкрытыеПриход = ПолучитьСтризСпк(спкКолонок);
	Обк.Записать();
	
	ЭтаФорма.Прочитать();
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьЭлемент(Команда)
	ЗаписатьЭлементНаСервере();
КонецПроцедуры
