
&НаСервереБезКонтекста
Функция ПолучитьМакет(сс)
	
	Если ЗначениеЗаполнено(сс)=Ложь Тогда Возврат Неопределено; КонецЕСЛИ;
	Если сс.Этогруппа Тогда Возврат Неопределено; КонецЕсли;
	
	хр = сс.хрОбработкаПечати.Получить();
	
	Если нрег(прав(сс.ИмяФайлаОбработки,4)) = ".mxl" Тогда
		
		ДвоичныеДанные = сс.хрОбработкаПечати.Получить();
		Поток = ДвоичныеДанные.ОткрытьПотокДляЧтения();
		Макет = Новый ТабличныйДокумент;
		Макет.Прочитать(Поток);
		Возврат Макет;
		
	КонецЕслИ;
	
	Возврат Неопределено;
	
конецФункции


&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	сс = Элементы.Список.ТекущаяСтрока;
	Если сс = Неопределено Тогда Возврат; КонецЕсли;
	Результат = ПолучитьМакет(сс);
	
	
	
	
КонецПроцедуры
