
&НаСервере
Процедура ОбновитьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	роЗаказНаряд.Ссылка КАК ЗаказНаряд,
	               |	роЗаказНаряд.Номер КАК Номер,
	               |	роЗаказНаряд.НомерОборудования КАК НомерОборудования
	               |ИЗ
	               |	Документ.роЗаказНаряд КАК роЗаказНаряд
	               |ГДЕ
	               |	роЗаказНаряд.ПометкаУдаления = ЛОЖЬ
	               |	И (роЗаказНаряд.Статус = &Статус или &Статус = Значение(Справочник.ро_Статусы.ПустаяСсылка))
	               |	И (роЗаказНаряд.Контрагент = &Контрагент или &Контрагент = Значение(Справочник.Контрагенты.ПустаяСсылка))
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	роЗаказНаряд.Номер";
	Запрос.УстановитьПараметр("Статус",фильтрСтатус);
	Запрос.УстановитьПараметр("Контрагент",фильтрКонтрагент);
	
	тблЗН.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСтрокаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	пДЛ = СтрДлина(Текст);
	
	Если флагПоиска=0 ТОгда
		имяРек = "Номер";
	ИНАче
		имяРек = "НомерОборудования";
	КонецЕСЛИ;
	Если пДл=0 ТОгда Возврат; КонецЕсли;
	
	Для каждого Стр из тблЗН Цикл
		Если Лев(Стр[имяРек],пДл) = Текст Тогда
			Элементы.тблЗН.ТекущаяСтрока= стр.ПолучитьИдентификатор();
			прервать;
		КонецЕСлИ;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСтрокаПриИзменении(Элемент)
		ФильтрСтрока = "";
КонецПроцедуры

&НаКлиенте
Процедура ТолькоВыбранныеПриИзменении(Элемент)
	Если ТолькоВыбранные Тогда
		Элементы.тблЗН.ОтборСтрок=Новый ФиксированнаяСтруктура("выбор",Истина);
	Иначе
		Элементы.тблЗН.ОтборСтрок=Неопределено;
	КонецЕСлИ;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Контрагент",фильтрКонтрагент);
	
	пСтатус = "";
	Если Параметры.Свойство("Статус",пСтатус) Тогда
		фильтрСтатус=Справочники.ро_Статусы[пСтатус];
	КонецЕСЛИ;
	
	ОбновитьНаСервере();
	
	тхт= "";
	Если ЗначениеЗаполнено(фильтрСтатус) ТОгда
		тхт = тхт+" Статус: "+фильтрСтатус;
	КонецЕсли;
	Если ЗначениеЗаполнено(фильтрКонтрагент) ТОгда
		тхт = тхт+" Контрагент: "+фильтрКонтрагент;
	КонецЕсли;
	
	ЭтаФорма.Заголовок = ЭтаФорма.Заголовок+тхт;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыбор(Команда=Неопределено)
	
	
	МАс = Новый Массив;
	Для каждого Стр из тблЗН Цикл
		Если Стр.выбор = Истина Тогда
			Мас.добавить(Стр.ЗаказНаряд);
			стр.выбор = ложь;
		КонецЕСли;
	КонецЦикла;
	ОповеститьОВыборе(Мас);
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Для каждого Стр из тблЗН Цикл
		Если Стр.выбор = Истина Тогда
			Отказ = Истина;
			
			ТекстВопроса = НСтр("ru = 'Подобранные заказ-наряды не обработаны.
			|
			|Обработать?'");
			
			Оповещение = Новый ОписаниеОповещения("ВопросПеренестиЗавершение", ЭтотОбъект);
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
			
			прервать;
			
		КонецЕСли;
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура ВопросПеренестиЗавершение(ОтветНаВопрос, ДополнительныеПараметры) Экспорт
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		ВыполнитьВыбор();
	ИначеЕсли ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда
		тблЗн.Очистить();
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

