
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕСли Параметры.Свойство("Результат",Результат) ТОгда
		//	Результат.Вывести(Параметры.Результат);	
	КонецеСЛИ;
	Параметры.Свойство("Заголовок",ЭтаФорма.Заголовок);

	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ПриПовторномОткрытииНаСервере()
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	ПриПовторномОткрытииНаСервере();
КонецПроцедуры
