Функция ПолучитьТекущийПользователь() Экспорт
	
	Есть = Ложь;
	Код = Лев(ИмяПользователя(),50);
	Если Код = "" ТОгда Код = "<Не указан>"; КонецЕсли;
	сс = Справочники.Пользователи.НайтиПоКоду(код);
	Если сс.Пустая() Тогда
		Обк = Справочники.Пользователи.СоздатьЭлемент();
		Обк.Код = Код;
		Есть=Истина;
	Иначе
		Обк = сс.ПолучитьОбъект();
	КонецЕСЛИ;
	
	Если Обк.Наименование <> ПолноеИмяПользователя() Тогда
		Обк.Наименование = ПолноеИмяПользователя();
		Есть=Истина;
	КонецЕСЛИ;
	
	Если ЗначениеЗаполнено(Обк.ФизЛицо) =Ложь Тогда
		ссФЛ = Справочники.ФизическиеЛица.НайтиПоНаименованию(Обк.Наименование);
		Если ссФЛ.Пустая()=Ложь Тогда
			Обк.ФизЛицо = ссФЛ;
			Есть=Истина;
		КонецЕсли;
	КонецЕСЛИ;
	
	Если Есть = Истина Тогда
		Обк.Записать();
	КонецЕСЛИ;
	
	Возврат Обк.Ссылка;
	
КонецФункции