
&НаСервере
Функция СткПолучитьСоединение() 
	
	Стк = Новый Структура();
	
	Стк.Вставить("Сервер","91.203.11.2");
	Стк.Вставить("Порт",53780);
	Стк.Вставить("Логин","Serv");
	Стк.Вставить("Пароль","SERVgfhjkm");
	                           
	Возврат Стк;
	
КонецФункции

&НаСервере
Функция СделатьЗапрос() 
	
	СткСоединение = СткПолучитьСоединение();
	
	Соединение = Новый HTTPСоединение(
									СткСоединение.Сервер, // сервер (хост)
									СткСоединение.Порт, // порт, по умолчанию для http используется 80, для https 443
									СткСоединение.Логин, // пользователь для доступа к серверу (если он есть)
									СткСоединение.Пароль, // пароль для доступа к серверу (если он есть)
									, // здесь указывается прокси, если он есть
									15, // таймаут в секундах, 0 или пусто - не устанавливать
									// защищенное соединение, если используется https
									);
	Запрос = Новый HTTPЗапрос("/uat_us/hs/entAPI/TTNPL");
	
	Стк = Новый Структура("ГосНом",СокрЛП(ФильтрГосНомер));
	хр = Новый ХранилищеЗначения(Стк);
	Запрос.УстановитьТелоИзСтроки(XMLстрока(хр));
	
	Результат = Соединение.POST(Запрос);
	
	Если Результат.КодСостояния <> 200 Тогда 
		Сообщить("Ошибка отправки: "+Результат.КодСостояния);
		Сообщить(результат.ПолучитьТелоКакСтроку());
		Возврат Неопределено;
	КонецЕСЛИ;  
	
	Возврат XMLЗначение(Тип("ХранилищеЗначения"),результат.ПолучитьТелоКакСтроку()).Получить()[1];
	
	
КонецФункции

&НаСервере
Процедура ОбновитьНаСервере()
	     Тбл = СделатьЗапрос();
		 тблПЛ.Загрузить(Тбл);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура тблПЛВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств(Этаформа.ВладелецФормы.Объект,Элементы.ТблПЛ.ДанныеСтроки(Выбраннаястрока));
	ЭтаФорма.Закрыть();
КонецПроцедуры
