
&НаКлиенте
Процедура ВыборФайла(Команда)
	
	
	Диалог = новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Если Команда.Имя = "ВыборФайлаКА" Тогда
		Если Элементы.ФормыПоКонтрагентам.ТекущаяСтрока=Неопределено Тогда Возврат; КонецеСЛИ;
	КонецесЛИ;
	
	Оо = Новый ОписаниеОповещения("ОО_ОбработкаВыборФайла",ЭтаФорма,Команда.Имя);
	Оо1 = Новый ОписаниеОповещения("ОО_НачалоОбработкаВыборФайла",ЭтаФорма);
	НачатьПомещениеФайлов(Оо,Диалог,Истина,ЭтаФорма.УникальныйИдентификатор,Оо1);
	
	
КонецПроцедуры


&НаКлиенте
Процедура ОО_ОбработкаВыборФайла(ПомещенныеФайлы, ДопПараметры)Экспорт
	Если ТипЗнч(ПомещенныеФайлы) <> Тип("Массив")	Тогда  Возврат; КонецеСЛИ;
	

	
	Для каждого помФайл из ПомещенныеФайлы Цикл
		
		Если  ДопПараметры = "ВыборФайлаКА" Тогда
			текстр = Элементы.ФормыПоКонтрагентам.ТекущиеДанные;
			текстр.АдресХраненияФайла = помФайл.Хранение;
			текстр.ИмяФайлаОбработки =помФайл.Имя;
			текстр.ЛОг = ""+ТекущаяДата()+" - "+ИмяПользователя()+" - "+ИмяКомпьютера();
			
		ИНаче
			АдресХраненияФайла = помФайл.Хранение;
			Объект.ИмяФайлаОбработки =помФайл.Имя;
			Объект.ЛОг = ""+ТекущаяДата()+" - "+ИмяПользователя()+" - "+ИмяКомпьютера();
		КонецеСЛИ;
		
	КонецЦикла;
		
КонецПроцедуры 


&НаКлиенте
Процедура ОО_НачалоОбработкаВыборФайла(ПомещаемыеФайлы,ОтказОтПомещенияВсехФайлов,ДополнительныеПараметры) экспорт
	
	Если ТипЗнч(ПомещаемыеФайлы) <> Тип("Массив")	Тогда Возврат; КонецеСЛИ;
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если  СокрлП(АдресХраненияФайла)<>"" Тогда
		ТекущийОбъект.хрОбработкаПечати = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресХраненияФайла));
	КонецЕсли;
	
	Для а=1 по Объект.ФормыПоКонтрагентам.Количество() Цикл
		Стр =Объект.ФормыПоКонтрагентам[а-1];
		Если СокрлП(Стр.АдресХраненияФайла)<>"" Тогда
			ТекущийОбъект.ФормыПоКонтрагентам[а-1].хрОбработкаПечати = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Стр.АдресХраненияФайла));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьАдрес(Рек)
	
	Обк = РеквизитФормыВЗначение("Объект");
	Возврат ПоместитьВоВременноеХранилище(Обк[Рек].Получить());
	
КонецФункции

Функция ПолучитьАдресКА(нс)
	
	Обк = РеквизитФормыВЗначение("Объект");
	ТекСтр = Обк.ФормыПоКонтрагентам.Получить(нс);
	Возврат ПоместитьВоВременноеХранилище(ТекСтр.хрОбработкаПечати.Получить());
	
КонецФункции

&НаКлиенте
Процедура СохранитьФайл(Команда)
	НачатьПолучениеФайлаССервера(ПолучитьАдрес("хрОбработкаПечати"),Объект.ИмяФайлаОбработки);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлКА(Команда)
		Если Элементы.ФормыПоКонтрагентам.ТекущаяСтрока=Неопределено Тогда Возврат; КонецеСЛИ;
	 ТекСтр = Элементы.ФормыПоКонтрагентам.ТекущиеДанные;
	
	НачатьПолучениеФайлаССервера(ПолучитьАдресКА(Элементы.ФормыПоКонтрагентам.ТекущиеДанные.НомерСтроки-1),ТекСтр.ИмяФайлаОбработки);
КонецПроцедуры
